iPig/src/InformationRegisters/ЖурналОсеменения/ЖурналОсеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОсеменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпоросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк1</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк2</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк1</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк2</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценкаСлучки</name>
    <type>
      <types>EnumRef.ОценкаСлучки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОсеменения/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура НомерЖивотногоПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПороды = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоПриИзменении(Элемент)
	НомерЖивотногоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		//ЖурналОпороса
	//	НаборЗаписей = РегистрыСведений.ЖурналОпороса.СоздатьНаборЗаписей(); 
	//    НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного); 
	//	НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
	//	НаборЗаписей.Прочитать(); 

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ЖурналОпоросаСрезПоследних.Период КАК Период
	//		|ИЗ
	//		|	РегистрСведений.ЖурналОпороса.СрезПоследних КАК ЖурналОпоросаСрезПоследних
	//		|ГДЕ
	//		|	ЖурналОпоросаСрезПоследних.НомерЖивотного = &НомерЖивотного
	//		|	И ЖурналОпоросаСрезПоследних.НомерОпороса = &НомерОпороса";
	//	
	//	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	//	Запрос.УстановитьПараметр("НомерОпороса", Запись.НомерОпороса);
	//	РезультатЗапроса = Запрос.Выполнить();		
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		Для Каждого Записи Из НаборЗаписей Цикл
	//			Записи.НомерОпороса = Запись.НомерОпороса;
	//			Записи.НомерЖивотного = Запись.НомерЖивотного;
	//			ДатаОпоросаСвиноматки = Константы.ПериодСупоросностиСвиноматки.Получить();
	//        	Записи.Период = Запись.Период + ДатаОпоросаСвиноматки * 60 * 60 * 24;
	//		КонецЦикла;
	//		НаборЗаписей.Записать();
	//	Иначе  		
	//        НоваяЗапись = НаборЗаписей.Добавить();  
	//		НоваяЗапись.НомерОпороса = Запись.НомерОпороса;
	//        НоваяЗапись.НомерЖивотного = Запись.НомерЖивотного;
	//		ДатаОпоросаСвиноматки = Константы.ПериодСупоросностиСвиноматки.Получить();
	//        НоваяЗапись.Период = Запись.Период + ДатаОпоросаСвиноматки * 60 * 60 * 24;
	//        НаборЗаписей.Записать();
	//	КонецЕсли;
	//	//Супоросность
	//	НаборЗаписей = РегистрыСведений.Супоросность.СоздатьНаборЗаписей(); 
	//    НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
	//	НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
	//	НаборЗаписей.Прочитать();
	//
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	СупоросностьСрезПоследних.Период КАК Период
	//		|ИЗ
	//		|	РегистрСведений.Супоросность.СрезПоследних КАК СупоросностьСрезПоследних
	//		|ГДЕ
	//		|	СупоросностьСрезПоследних.НомерЖивотного = &НомерЖивотного
	//		|	И СупоросностьСрезПоследних.НомерОпороса = &НомерОпороса";
	//	
	//	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	//	Запрос.УстановитьПараметр("НомерОпороса", Запись.НомерОпороса);		
	//	РезультатЗапроса = Запрос.Выполнить();		
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		Для Каждого Записи Из НаборЗаписей Цикл
	//			Записи.НомерОпороса = Запись.НомерОпороса;
	//			Записи.НомерЖивотного = Запись.НомерЖивотного;
	//			ДатаУЗИ = Константы.ДнейБезУЗИСвиноматки.Получить(); 
	//        	Записи.Период = Запись.Период + ДатаУЗИ * 60 * 60 * 24;
	//		КонецЦикла;
	//		НаборЗаписей.Записать();
	//	Иначе  			
	//        НоваяЗапись = НаборЗаписей.Добавить(); 
	//		НоваяЗапись.НомерОпороса = Запись.НомерОпороса;
	//        НоваяЗапись.НомерЖивотного = Запись.НомерЖивотного; 
	//		ДатаУЗИ = Константы.ДнейБезУЗИСвиноматки.Получить(); 
	//        НоваяЗапись.Период = Запись.Период + ДатаУЗИ * 60 * 60 * 24;
	//        НаборЗаписей.Записать(); 
	//	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ПараметрыЗаписи)
	Если Параметры.Свойство("НомерЖивотного") Тогда
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
		Запись.НомерОпороса 	= Параметры.НомерОпороса;
		Запись.ДатаВвода		= Параметры.ДатаВвода;
		Запись.КодПороды 		= Параметры.Порода;
	КонецЕсли;
	Если Параметры.Свойство("ФормаОткрыта") Тогда
		Открытие = Истина;
	Иначе
		Открытие = Ложь;
	КонецЕсли;
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоХрякПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотногоХряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПородыХряк = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоХрякПриИзменении(Элемент)
	НомерЖивотногоХрякПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

КонецПроцедуры
&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		Если ДанныеПоСвиноматкам.Количество() = 1 Тогда
			Запись.НомерЖивотного = ДанныеПоСвиноматкам[0].Значение.НомерЖивотного;
			Запись.ДатаВвода	  = ДанныеПоСвиноматкам[0].Значение.ДатаВвода;
			Запись.КодПороды	  = ДанныеПоСвиноматкам[0].Значение.КодПороды;
		Иначе
			ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
			Если ВыбСтрокаМеню <> Неопределено Тогда
				Реквизиты = ВыбСтрокаМеню.Значение;
				Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
				Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
				Запись.КодПороды	  = Реквизиты.КодПороды;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОсемененияПриИзменении(Элемент)
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Открытие = Истина Тогда
		Записать();
		_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоХряк1ПриИзменении(Элемент)
	НомерЖивотногоХряк1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоХряк1ПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотногоХряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПородыХряк1 = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоХряк2ПриИзменении(Элемент)
	НомерЖивотногоХряк2ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоХряк2ПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотногоХряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПородыХряк2 = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	//Отбор = Новый Структура("НомерЖивотного",Запись.НомерЖивотного);
//	НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
//	НаборЗаписей.Прочитать();
//	Если НаборЗаписей.Количество() = 0 Тогда
//		НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
//		НоваяСтрока.Период = ТекущаяДата();
//		НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
//		НоваяСтрока.ДатаОсеменения = Запись.ДатаОсеменения;
//		//НоваяСтрока.КодПороды = Запись.КодПороды;
//		//НоваяСтрока.ДатаВыбытие = Запись.ДатаВыбытие;
//		//НоваяСтрока.ПричинаВыбытия = Запись.НазваниеПричины;
//		//НоваяСтрока.ДатаАборта = Запись.ДатаАбортаОпороса;
//		//НоваяСтрока.ДатаОтъема = Запись.ДатаОтъема;
//		НоваяСтрока.НомерЖивотногоХряк = Запись.НомерЖивотногоХряк;
//		НоваяСтрока.КодРаботника = Запись.Работник;
//		НоваяСтрока.Записать();
//	Иначе	
//		Для Каждого СтрНаборЗаписей из НаборЗаписей Цикл
//			СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
//			СтрНаборЗаписей.ДатаСлучка = Запись.Период;
//			//СтрНаборЗаписей.КодПороды = Запись.КодПороды;
//			//СтрНаборЗаписей.ДатаВыбытие = Запись.ДатаВыбытие;
//			//СтрНаборЗаписей.ПричинаВыбытия = Запись.НазваниеПричины;
//			//СтрНаборЗаписей.ДатаАборта = Запись.ДатаАбортаОпороса;
//			//СтрНаборЗаписей.ДатаОтъема = Запись.ДатаОтъема; 
//			СтрНаборЗаписей.КодРаботника = Запись.Работник;
//			СтрНаборЗаписей.НомерЖивотногоХряк = Запись.НомерЖивотногоХряк;
//			СтрНаборЗаписей.КодПородыХряк = Запись.КодПородыХряк;
//		КонецЦикла;
//		НаборЗаписей.Записать();
//	КонецЕсли;
//КонецПроцедуры
